{"pageProps":{"posts":[{"slug":"c2-redirectors-part1","excerpt":"Command and Control (C2) infrastructure serves as the critical communication backbone of offensive security operations, enabling operators to maintain reliable communication channels with implants dep...","title":"Mastering C2 Redirectors: Advanced Infrastructure for Modern Red Team Operations (Part 1)","date":"2025-03-19","tags":["Red Team","C2","Infrastructure","OPSEC","Network Security"]},{"slug":"calculator-shellcode-analysis","excerpt":"In the realm of cybersecurity, shellcode represents one of the most fundamental building blocks for both offensive security practitioners and defensive analysts. These compact machine code sequences, ...","title":"Mastering x86 Shellcode: A Deep Dive into Calculator-Launching Payload Development","date":"2025-03-18","tags":["Shellcode","Assembly","Windows","Exploit Development"]},{"slug":"pen300-osep-certification","excerpt":"In the dynamic landscape of penetration testing, knowledge growth is a perpetual journey. Leading this learning curve is the Offensive Security Experienced Penetration Tester (OSEP) certification, off...","title":"An In-Depth Look at PEN-300 and OSEP: Succeeding in the Offensive Security Path","date":"2023-07-09","tags":["certification","offensive security","penetration testing","OSEP"]},{"slug":"cve-2023-0830","excerpt":"Recently, I discovered a vulnerability which was in a backup and restore script used in EasyNAS, a popular open-source network-attached storage (NAS) solution. The CVE-2023-0830 is published on https:...","title":"Exploiting the vulnerability and gaining root privileges (CVE-2023-0830)","date":"2023-02-14","tags":["vulnerability","easynas","command injection","cve"]},{"slug":"graphql-security-flaws","excerpt":"GraphQL is a query language and runtime environment for APIs that allows clients to request only the data they need. This article will cover the most common security flaws in this environment. Auditin...","title":"GraphQL Security Flaws and Exploitation","date":"2023-01-10","tags":["security","graphql","penetration testing","api"]}]},"__N_SSG":true}